a = [1,2,3,4,5]
a[1,3]

4,7
配列についてもっと詳しく

配列[位置、所得する長さ]

a = [1,2,3,4,5]
a[1,3]
# => 2,3,4


a = [1,2,3,4,5]
a.values_at(0,2,4)
# 取得したい要素の添字を複数指定できる。



a[a.size -1]
# 最後の要素を取得
a[-1]
a[-2,2]





a = [1,2,3]
a.last
a.last(2)
# 引数に0以上の数値を渡すと、最後のnこの要素を取得できます。

a.first
a.first(2)


a = [1,2,3]
a[-3] = -10
# =>[ -10,2,3]
a[-4] = 10
# エラーが出る。


a = [1,2,3,4,5]
a[1,3] = 100
a
# =>[1,100,5]



a = []
a.push(1)
a.push(2,3)
[1,2,3]


a = [1,2,3,1,2,3]

a.delete(2)
a[1,3,1,3]


a.delete(5)
a


4.7.3





a = [1]
b = [2,3]
a.concat(b)










